#----------------------------------------------------------------------------------
# {AppName}\urls.py
#----------------------------------------------------------------------------------

from django.urls import path
from customer import views
urlpatterns = [
    #{aaa},{Aaa}
    # 全件データ取得（Filterの指定で条件の設定も可能）
    path('{aaa}s', views.{Aaa}List.as_view()),
    # 一件データ取得
    path('{aaa}/<int:pk>', views.{Aaa}.as_view()),
    # 一件データ更新
    path('{aaa}/<int:pk>/update/', views.{Aaa}Update.as_view()),
]

#----------------------------------------------------------------------------------
# 
#----------------------------------------------------------------------------------
